http-benchmarks/output/run-httpserv_go-60000-1000.txt
Running 1m test @ http://localhost:8080
  24 threads and 1000 connections
  Thread calibration: mean lat.: 2268.646ms, rate sampling interval: 8257ms
  Thread calibration: mean lat.: 2304.460ms, rate sampling interval: 8380ms
  Thread calibration: mean lat.: 2278.447ms, rate sampling interval: 8306ms
  Thread calibration: mean lat.: 2280.023ms, rate sampling interval: 8335ms
  Thread calibration: mean lat.: 2188.774ms, rate sampling interval: 7860ms
  Thread calibration: mean lat.: 2354.167ms, rate sampling interval: 8486ms
  Thread calibration: mean lat.: 2345.171ms, rate sampling interval: 8503ms
  Thread calibration: mean lat.: 2342.480ms, rate sampling interval: 8503ms
  Thread calibration: mean lat.: 2307.875ms, rate sampling interval: 8351ms
  Thread calibration: mean lat.: 2335.258ms, rate sampling interval: 8470ms
  Thread calibration: mean lat.: 2317.802ms, rate sampling interval: 8486ms
  Thread calibration: mean lat.: 2310.029ms, rate sampling interval: 8429ms
  Thread calibration: mean lat.: 2280.066ms, rate sampling interval: 8318ms
  Thread calibration: mean lat.: 2249.635ms, rate sampling interval: 7995ms
  Thread calibration: mean lat.: 2291.645ms, rate sampling interval: 8278ms
  Thread calibration: mean lat.: 2313.843ms, rate sampling interval: 8327ms
  Thread calibration: mean lat.: 2320.949ms, rate sampling interval: 8388ms
  Thread calibration: mean lat.: 2293.343ms, rate sampling interval: 8269ms
  Thread calibration: mean lat.: 2304.106ms, rate sampling interval: 8331ms
  Thread calibration: mean lat.: 2259.189ms, rate sampling interval: 8159ms
  Thread calibration: mean lat.: 2234.229ms, rate sampling interval: 8110ms
  Thread calibration: mean lat.: 2205.366ms, rate sampling interval: 8003ms
  Thread calibration: mean lat.: 2175.971ms, rate sampling interval: 7868ms
  Thread calibration: mean lat.: 2196.877ms, rate sampling interval: 7864ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.08s     6.66s   28.92s    58.01%
    Req/Sec     1.35k    11.76     1.38k    73.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   16.06s 
 75.000%   21.81s 
 90.000%   25.26s 
 99.000%   27.80s 
 99.900%   28.44s 
 99.990%   28.70s 
 99.999%   28.82s 
100.000%   28.93s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3799.039     0.000000            2         1.00
    6889.471     0.100000       161069         1.11
    9183.231     0.200000       321893         1.25
   11476.991     0.300000       482890         1.43
   13770.751     0.400000       643822         1.67
   16064.511     0.500000       804213         2.00
   17219.583     0.550000       885117         2.22
   18366.463     0.600000       965393         2.50
   19513.343     0.650000      1045675         2.86
   20660.223     0.700000      1126541         3.33
   21807.103     0.750000      1206932         4.00
   22380.543     0.775000      1246876         4.44
   22953.983     0.800000      1286698         5.00
   23543.807     0.825000      1327794         5.71
   24117.247     0.850000      1367978         6.67
   24690.687     0.875000      1408274         8.00
   24969.215     0.887500      1427809         8.89
   25264.127     0.900000      1448216        10.00
   25559.039     0.912500      1468407        11.43
   25853.951     0.925000      1488195        13.33
   26165.247     0.937500      1508233        16.00
   26329.087     0.943750      1518504        17.78
   26492.927     0.950000      1528559        20.00
   26656.767     0.956250      1538295        22.86
   26836.991     0.962500      1548530        26.67
   27017.215     0.968750      1558085        32.00
   27115.519     0.971875      1563120        35.56
   27230.207     0.975000      1568748        40.00
   27328.511     0.978125      1573320        45.71
   27443.199     0.981250      1578450        53.33
   27557.887     0.984375      1583267        64.00
   27623.423     0.985938      1585872        71.11
   27688.959     0.987500      1588381        80.00
   27754.495     0.989062      1590785        91.43
   27836.415     0.990625      1593662       106.67
   27901.951     0.992188      1595786       128.00
   27951.103     0.992969      1597251       142.22
   28000.255     0.993750      1598601       160.00
   28033.023     0.994531      1599467       182.86
   28082.175     0.995313      1600687       213.33
   28147.711     0.996094      1602155       256.00
   28180.479     0.996484      1602838       284.44
   28213.247     0.996875      1603494       320.00
   28246.015     0.997266      1604091       365.71
   28278.783     0.997656      1604650       426.67
   28311.551     0.998047      1605162       512.00
   28327.935     0.998242      1605400       568.89
   28360.703     0.998437      1605832       640.00
   28377.087     0.998633      1606030       731.43
   28409.855     0.998828      1606383       853.33
   28442.623     0.999023      1606704      1024.00
   28459.007     0.999121      1606850      1137.78
   28475.391     0.999219      1606986      1280.00
   28508.159     0.999316      1607243      1462.86
   28524.543     0.999414      1607363      1706.67
   28540.927     0.999512      1607466      2048.00
   28557.311     0.999561      1607563      2275.56
   28573.695     0.999609      1607655      2560.00
   28590.079     0.999658      1607740      2925.71
   28606.463     0.999707      1607804      3413.33
   28622.847     0.999756      1607866      4096.00
   28639.231     0.999780      1607923      4551.11
   28639.231     0.999805      1607923      5120.00
   28655.615     0.999829      1607973      5851.43
   28671.999     0.999854      1608016      6826.67
   28688.383     0.999878      1608059      8192.00
   28688.383     0.999890      1608059      9102.22
   28704.767     0.999902      1608092     10240.00
   28704.767     0.999915      1608092     11702.86
   28721.151     0.999927      1608121     13653.33
   28737.535     0.999939      1608144     16384.00
   28737.535     0.999945      1608144     18204.44
   28737.535     0.999951      1608144     20480.00
   28753.919     0.999957      1608162     23405.71
   28770.303     0.999963      1608178     27306.67
   28770.303     0.999969      1608178     32768.00
   28770.303     0.999973      1608178     36408.89
   28786.687     0.999976      1608190     40960.00
   28786.687     0.999979      1608190     46811.43
   28803.071     0.999982      1608201     54613.33
   28803.071     0.999985      1608201     65536.00
   28803.071     0.999986      1608201     72817.78
   28819.455     0.999988      1608206     81920.00
   28819.455     0.999989      1608206     93622.86
   28835.839     0.999991      1608210    109226.67
   28835.839     0.999992      1608210    131072.00
   28852.223     0.999993      1608213    145635.56
   28852.223     0.999994      1608213    163840.00
   28868.607     0.999995      1608216    187245.71
   28868.607     0.999995      1608216    218453.33
   28868.607     0.999996      1608216    262144.00
   28884.991     0.999997      1608219    291271.11
   28884.991     0.999997      1608219    327680.00
   28884.991     0.999997      1608219    374491.43
   28884.991     0.999998      1608219    436906.67
   28884.991     0.999998      1608219    524288.00
   28901.375     0.999998      1608220    582542.22
   28901.375     0.999998      1608220    655360.00
   28901.375     0.999999      1608220    748982.86
   28917.759     0.999999      1608221    873813.33
   28917.759     0.999999      1608221   1048576.00
   28917.759     0.999999      1608221   1165084.44
   28917.759     0.999999      1608221   1310720.00
   28917.759     0.999999      1608221   1497965.71
   28934.143     0.999999      1608222   1747626.67
   28934.143     1.000000      1608222          inf
#[Mean    =    16079.568, StdDeviation   =     6658.351]
#[Max     =    28917.760, Total count    =      1608222]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1933864 requests in 1.00m, 3.94GB read
Requests/sec:  32232.67
Transfer/sec:     67.32MB

JSON Output:
{
	"requests": 1933864,
	"duration_in_microseconds": 59997007.00,
	"bytes": 4235162160,
	"requests_per_sec": 32232.67,
	"bytes_transfer_per_sec": 70589557.24,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 16064511
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 21807103
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 25264127
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 27803647
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 28442623
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 28704767
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 28819455
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 28934143
		}
	]
}